# ArcReferenceType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarShapeConstraint180DegreeBendRadius..::..ArcReferenceType Property
RebarShapeConstraint180DegreeBendRadius Class See Also
---
A choice of rule for measuring the radius.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public RebarShapeArcReferenceType ArcReferenceType { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ArcReferenceType As RebarShapeArcReferenceType
	Get
```

Visual C++
---
```text
public:
property RebarShapeArcReferenceType ArcReferenceType {
	RebarShapeArcReferenceType get ();
}
```

# See Also
RebarShapeConstraint180DegreeBendRadius Class
Autodesk.Revit.DB.Structure Namespace